using System.Runtime.Serialization;

namespace IranKish.Models
{

    public class IranKishVerifyErros
    {
        public static Dictionary<string, string> Errors = new Dictionary<string, string>
        {
            { "03", "پذیرنده فروشگاهی نامعتبر است | اطلاعات پذیرنده در سوئیچ شاپرکی فعال نمی‌باشد | از طریق سامانه تیکتینگ به منظور رفع مشکل به مدیریت عملیات و راهبری (اداره پشتیبانی نرم‌افزار) ارجاع می‌شود." },
            { "05", "از انجام تراکنش صرف‌نظر شد/DO NOT HONOUR | صندوق پر شده است یا کارت معتبر نیست | می‌بایست دارنده کارت به منظور پیگیری به بانک مراجعه نماید." },
            { "12", "خطای 12/تراکنش نامعتبر | عدم انجام تراکنش با برخی از کارت‌های بانکی به دلیل غیرفعال بودن گزینه خرید بر روی کارت | می‌بایست دارنده کارت به منظور پیگیری به بانک مراجعه نماید." },
            { "13", "خطای 13/مبلغ نامعتبر | تعیین سقف مبلغ خرید بر روی کارت | می‌بایست دارنده کارت به منظور پیگیری به بانک مراجعه نماید." },
            { "17", "خطای 17/کنسل شدن خرید توسط کاربر | | " },
            { "64", "مبلغ تراکنش نادرست است | جمع مبالغ تقسیم وجوه برابر مبلغ کل تراکنش نمی‌باشد | " },
            { "94", "تراکنش تکراری است | مشکل مقطعی | سعی مجدد در زمان دیگر." },
            { "2-5", "تراکنش اصلی یافت نشد | مشخص نبودن وضعیت تراکنش | مشکل مقطعی، سعی مجدد در زمان دیگر." },
            { "77", "روز مالی تراکنش نامعتبر است | تراکنش در زمان Cut Off انجام شده است | مبلغ بعد از 96 ساعت به حساب دارنده درگاه واریز می‌شود. در صورت عدم واریز طی 96 ساعت، به واحد مغایرت از طریق ثبت در پورتال مغایرت ارسال می‌شود." },
            { "97", "کد تولید کد اعتبار سنجی نامعتبر است | | " },
            { "30", "فرمت پیام نادرست است | مشکل مقطعی | سعی مجدد در زمان دیگر." },
            { "34", "تراکنش مالی تأیید نشده است | مغایرت سیستمی | سیستمی (در صورت کسر مبلغ، تا 72 ساعت کاری مبلغ به حساب دارنده کارت عودت داده می‌شود)." },
            { "86", "در حال انجام Sign Off است | | " },
            { "55", "رمز کارت نادرست است | رمز کارت اشتباه وارد شده است | رمز کارت به‌صورت صحیح وارد شود." },
            { "40", "عمل درخواستی پشتیبانی نمی‌شود | | " },
            { "57", "انجام تراکنش مورد درخواست توسط پایانه انجام‌دهنده مجاز نمی‌باشد | تراکنش خرید زیر 1000 ریال می‌باشد | مبلغ خرید را حداقل 1000 ریال انتخاب نمایید." },
            { "58", "انجام تراکنش مورد درخواست توسط پایانه انجام‌دهنده مجاز نمی‌باشد | | " },
            { "63", "تمهیدات امنیتی نقض گردیده است/کلید MAC اشتباه است | ناتوانی درگاه در تولید و ارسال MAC به سمت سوئیچ PSP | ابتدا یک خرید 1000 ریالی انجام داده. از ساعت 12 ظهر به بعد، این مشکل در اولین ساعت زوج رفع می‌شود." },
            { "84", "اشکال در سیستم مرکزی | مشکل مقطعی | سعی مجدد در زمان دیگر." },
            { "96", "قوانین سامانه نقض گردیده است، خطای داخلی سامانه/اشکال در سیستم مرکزی | اشکال در سیستم مرکزی | مشکل مقطعی، سعی مجدد در زمان دیگر." },
            { "80", "اشکال در حساب دارنده کارت | مشکل مقطعی | سعی مجدد در زمان دیگر." },
            { "02", "تراکنش قبلاً برگشت شده است | تراکنش برگشت خورده است | مشکل مقطعی، سعی مجدد در زمان دیگر." },
            { "54", "تاریخ انقضا کارت سررسید شده است | | می‌بایست دارنده کارت به منظور پیگیری به بانک مراجعه نماید." },
            { "62", "کارت محدود شده است | تعیین سقف مبلغ تراکنش خرید روزانه بر روی کارت | می‌بایست دارنده کارت به منظور پیگیری به بانک مراجعه نماید." },
            { "75", "تعداد دفعات ورود رمز اشتباه از حد مجاز فراتر رفته است | رمز کارت بیش از 3 مرتبه به‌طور اشتباه وارد شده است | می‌بایست دارنده کارت به منظور پیگیری به بانک مراجعه نماید." },
            { "14", "اطلاعات کارت صحیح نمی‌باشد | | می‌بایست دارنده کارت به منظور پیگیری به بانک مراجعه نماید." },
            { "51", "موجودی حساب کافی نمی‌باشد | مبلغ مورد نظر در حساب دارنده کارت نیست | موجودی حساب تأمین شود." },
            { "56", "اطلاعات کارت یافت نشد/اطلاعات کارت نامعتبر است | کارت نامعتبر است | می‌بایست دارنده کارت به منظور پیگیری به بانک مراجعه نماید." },
            { "61", "مبلغ تراکنش بیش از حد مجاز است | مبلغ تراکنش از حد مجاز (سقف تعیین‌شده کارت) بیشتر است | می‌بایست دارنده کارت به منظور پیگیری به بانک مراجعه نماید." },
            { "65", "تعداد دفعات انجام تراکنش بیش از حد مجاز است | تعیین سقف تعداد تراکنش خرید روزانه بر روی کارت | می‌بایست دارنده کارت به منظور پیگیری به بانک مراجعه نماید." },
            { "93", "شلوغی سرور/تراکنش کامل نشد | ترافیک شبکه در سیستم بانکی (صادرکننده کارت) | می‌بایست تراکنش را مجدد و در زمان‌های مختلف تکرار نماید." },
            { "92", "کارت شتابی نمی‌باشد | | می‌بایست تراکنش با کارت شتابی انجام شود." },
            { "91", "زمان پاسخ بیش از حد مجاز | خطای ارتباطی | مبلغ طی 72 ساعت کاری به حساب دارنده کارت واریز می‌گردد. در صورت عدم واریز طی 72 ساعت، می‌بایست با سامانه 29911 تماس برقرار نماید." },
            { "90", "تراکنش در زمان Cut Off انجام شده است | تراکنش در زمان Cut Off انجام شده است | مبلغ طی 96 ساعت کاری به حساب دارنده درگاه واریز می‌شود. در صورت عدم واریز طی 96 ساعت، به واحد مغایرت از طریق ثبت در پورتال مغایرت ارسال شود." },
            { "78", "کارت فعال نیست | | می‌بایست دارنده کارت به منظور پیگیری به بانک مراجعه نماید." },
            { "79", "حساب متصل به کارت بسته یا دارای اشکال است | | می‌بایست دارنده کارت به منظور پیگیری به بانک مراجعه نماید." },
            { "42", "کارت یا حساب مبدا/مقصد در وضعیت پذیرش نمی‌باشد | | می‌بایست دارنده کارت به منظور پیگیری به بانک مراجعه نماید." },
            { "31", "عدم تطابق کد ملی خریدار با دارنده کارت | | می‌بایست دارنده کارت به منظور پیگیری به بانک مراجعه نماید." },
            { "200", "تراکنش با level 200 | پذیرنده به دلیل انجام نشدن تراکنش با مرکز تماس ارتباط برقرار کرده و درخواست پیگیری دارند | چنانچه تراکنشی با level 200 در برنامه RMS مشاهده گردید، می‌بایست به پذیرنده اعلام نمایید در حال حاضر امکان پیگیری این مورد مقدور نمی‌باشد و به جهت پیگیری مجدد 1 ساعت بعد تماس حاصل کنند. و این مورد ثبت تماس شود." },
            { "98", "سقف استفاده از رمز دوم ایستا به پایان رسیده است | | سعی مجدد در روز مالی بعدی." }
        };
    }
}
